import time
from snake import snake

def dialog_10():

    time.sleep(3)
    print('- У нас множество видов и сортов, чаи все хорошие, завезенные из Малайзии. У нас есть и \n'
          'множество сортов на любой размер кошелька.')

    time.sleep(3)
    print('Сидя на неудобной подушке, я рассуждал, сколько людей сидели на этом же месте и пили эту отраву. \n'
          'Серьёзно, ведь это было похоже на заваренный чай в холодной воде, который потом чуть подогрели в \n'
          'микроволновке. Мне не рассказали ни про сорта, ни про цены, поэтому я сидел в напряжении, боясь, \n '
          'что я могу оставить здесь все заработанные деньги на стройке. \n'
          'Полностью согревшись, я решил, что надо сваливать, подошел к администратору и спросил сколько я \n '
          'им должен. \n')
    time.sleep(3)
    print( '- Вы пили цветочный чай Tienchi , который собирали в Китае. К оплате 1750 рублей. \n')
    time.sleep(3)
    print('- А он разве не из Малайзии? - Выпучив глаза и посмотрев на малюсенькую чашку, \n'
          'что стояла около подушки. \n')
    time.sleep(3)
    print('- Производится в Малайзии, собирается в Китае, пакетируется в России. \n')

    time.sleep(3)
    print('Тут ты понял, что выход здесь один - бежать')
def dialog_1():


    b = input('Находясь в своих мыслях я даже и не заметил, как наткнулся на красивую \n'
              'девушку, которая стояла на улице, зазывая всех подряд на чайную церемонию. \n '
              '- Молодой человек, скажите, пожалуйста, вы любите чай. Хотите попробовать нашего традиционного? \n'
              '1. На улице слишком холодно, чтобы отказываться от чая, он не должен стоить очень дорого. \n'
              '2. Я пью только водку, особенно в такую погоду!\n')
    if '1' in b:
        dialog_10()
        snake()
    if '2' in b:
        snake()






def dialog_2():

    print('После интенсивной пробежки, передо мной возникло небольшое двухэтажное здание, \n'
          'которое светилось со всех сторон, а над входом находилась вывеска «brothers».\n')

    time.sleep(3)
    print('Это лучше, чем быть пойманным полицией, и пойти отрабатывать 120 часов, оставшись \n'
          'в этом городе на энное количество суток. \n'
          'Перед входом стоял ухоженный мужчина крепкого телосложения. \n')

    time.sleep(3)
    print('- Куда вам? – грозно сказал он \n '
          '- Туда! – чуть ли не ткнул пальцем я в его грудь, что закрывала проход внутрь \n')